app/controllers/manufacturers_controller.rb

  def index
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fiat"], ["created_at", "2020-01-12 03:37:02.540006"], ["updated_at", "2020-01-12 03:37:02.540006"]]

  def update
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.update(manufacturer_params)
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "manufacturers" SET "name" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["name", "bmw"], ["updated_at", "2020-01-12 03:37:13.506290"], ["id", 1]]